// Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

int[] CreateArrayRndInt(int size, int min, int max)
{
    int[] array = new int[size];
    Random rnd = new Random();
    for (int i = 0; i < size; i++)
    {
        array[i] = rnd.Next(min, max);
    }
    return array;
}

void PrintArray(int[] array)
{
    Console.Write("[");
    for (int i = 0; i < array.Length; i++)
    {
        if (i < array.Length - 1) Console.Write($"{array[i]}, ");
        else Console.Write($"{array[i]}");
    }
    Console.Write("]  ");
}

int FindEvenNumbers(int[] array)
{
    int result = 0;
    for (int i = 0; i < array.Length; i++)
    {
        if (array[i] % 2 == 0) result ++;
    }
    return result;
}

Console.WriteLine("Введите размер массива: ");
int razm = Convert.ToInt32(Console.ReadLine());
int[] arr = CreateArrayRndInt(razm, 100, 999);
PrintArray(arr);
int res = FindEvenNumbers (arr);
Console.WriteLine ($"Количество чётных чисел = {res}");